In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

/Users/tanmayk/.pyenv/versions/3.9.1/envs/SLM-Code/lib/python3.9/site-packages/pandas/compat/__init__.py:124: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [3]:
training_data = pd.read_csv('data/train_base.csv')
test_data = pd.read_csv('data/test_base.csv')

In [4]:
training_data.head()

   ID  Cycle       S1      S2     S3      S4  TTF  TTF_LABEL
0   1      1  1400.60  554.36  47.47  521.66  191          0
1   1      2  1403.14  553.75  47.49  522.28  190          0
2   1      3  1404.20  554.26  47.27  522.42  189          0
3   1      4  1401.87  554.45  47.13  522.86  188          0
4   1      5  1406.22  554.00  47.28  522.19  187          0

In [7]:
test_data.head()

   ID  Cycle       S1      S2     S3      S4  TTF  TTF_LABEL
0   1     31  1398.91  554.42  47.23  521.79  112          0
1   2     49  1410.83  553.52  47.67  521.74   98          0
2   3    126  1418.89  552.59  47.88  520.83   69          0
3   4    106  1406.88  552.64  47.65  521.88   82          0
4   5     98  1419.36  553.29  47.46  521.00   91          0

In [9]:
# Identify missing values
training_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20631 entries, 0 to 20630
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         20631 non-null  int64
 1   Cycle      20631 non-null  int64
 2   S1         20631 non-null  float64
 3   S2         20631 non-null  float64
 4   S3         20631 non-null  float64
 5   S4         20631 non-null  float64
 6   TTF        20631 non-null  int64
 7   TTF_LABEL  20631 non-null  int64
dtypes: float64(4), int64(4)
memory usage: 1.3 MB

In [10]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         100 non-null    int64
 1   Cycle      100 non-null    int64
 2   S1         100 non-null    float64
 3   S2         100 non-null    float64
 4   S3         100 non-null    float64
 5   S4         100 non-null    float64
 6   TTF        100 non-null    int64
 7   TTF_LABEL  100 non-null    int64
dtypes: float64(4), int64(4)
memory usage: 6.4 KB

In [11]:
training_data.describe()

,ID,Cycle,S1,S2,S3,S4,TTF,TTF_LABEL
count,20631.000000,20631.000000,20631.000000,20631.000000,20631.000000,20631.000000,20631.000000,20631.000000
mean,51.506568,108.807862,1408.933782,553.367711,47.541168,521.413470,107.807862,0.150259
std,29.227633,68.880990,9.000605,0.885092,0.267087,0.737553,68.880990,0.357334
min,1.000000,1.000000,1382.250000,549.850000,46.850000,518.690000,0.000000,0.000000
25%,26.000000,52.000000,1402.360000,552.810000,47.350000,520.960000,51.000000,0.000000
50%,52.000000,104.000000,1408.040000,553.440000,47.510000,521.480000,103.000000,0.000000
75%,77.000000,156.000000,1414.555000,554.010000,47.700000,521.950000,155.000000,0.000000
max,100.000000,362.000000,1441.490000,556.060000,48.530000,523.380000,361.000000,1.000000